apache/nuttx/arch/arm/src/samv7/chip/samv71_pinmap.h
/************************************************************************************
 * arch/arm/src/samv7/chip/samv71_pinmap.h
 *
 *   Copyright (C) 2015 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_SAMV7_CHIP_SAMV71_PINMAP_H
#define __ARCH_ARM_SRC_SAMV7_CHIP_SAMV71_PINMAP_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "sam_gpio.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* GPIO pin definitions *************************************************************/
/* Alternate Pin Functions
 *
 * These are mostly for reference and are not in pin configuration.
 */

#define GPIO_AFE0_AD0        (GPIO_ALTERNATE | GPIO_PORT_PIOD | GPIO_PIN30)
#define GPIO_AFE0_AD1        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN21)
#define GPIO_AFE0_AD2        (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN3)
#define GPIO_AFE0_AD3        (GPIO_ALTERNATE | GPIO_PORT_PIOE | GPIO_PIN5)
#define GPIO_AFE0_AD4        (GPIO_ALTERNATE | GPIO_PORT_PIOE | GPIO_PIN4)
#define GPIO_AFE0_AD5        (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN2)
#define GPIO_AFE0_AD6        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN17)
#define GPIO_AFE0_AD7        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN18)
#define GPIO_AFE0_AD8        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN19)
#define GPIO_AFE0_AD9        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN20)
#define GPIO_AFE0_AD10       (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN0)

#define GPIO_AFE1_AD0        (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN1)
#define GPIO_AFE1_AD1        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN13)
#define GPIO_AFE1_AD10       (GPIO_ALTERNATE | GPIO_PORT_PIOE | GPIO_PIN3)
#define GPIO_AFE1_AD11       (GPIO_ALTERNATE | GPIO_PORT_PIOE | GPIO_PIN0)
#define GPIO_AFE1_AD2        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN15)
#define GPIO_AFE1_AD3        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN12)
#define GPIO_AFE1_AD4        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN29)
#define GPIO_AFE1_AD5        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN30)
#define GPIO_AFE1_AD6        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN31)
#define GPIO_AFE1_AD7        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN26)
#define GPIO_AFE1_AD8        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN27)
#define GPIO_AFE1_AD9        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN0)

#define GPIO_DAC0            (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN13)
#define GPIO_DAC1            (GPIO_ALTERNATE | GPIO_PORT_PIOD | GPIO_PIN0)

#define GPIO_ERASE           (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN12)

#define GPIO_PIODC0          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN3)
#define GPIO_PIODC1          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN4)
#define GPIO_PIODC2          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN5)
#define GPIO_PIODC3          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN9)
#define GPIO_PIODC4          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN10)
#define GPIO_PIODC5          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN11)
#define GPIO_PIODC6          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN12)
#define GPIO_PIODC7          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN13)
#define GPIO_PIODCCLK        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN22)
#define GPIO_PIODCEN1        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN14)
#define GPIO_PIODCEN2        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN21)

#define GPIO_RTCOUT0         (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN0)
#define GPIO_RTCOUT1         (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN1)

#define GPIO_SWCLK           (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN7)
#define GPIO_SWDIO           (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN6)
#define GPIO_TCK             (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN7)
#define GPIO_TDI             (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN4)
#define GPIO_TDO             (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN5)
#define GPIO_TMS             (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN6)
#define GPIO_TRACESWO        (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN5)

